Revit 2027 API
RebarUpdateCurvesData.ErrorMessage Property
 The reason for calculation failure. If the calculation fails, this message will be shown in an error, or warning if we are editing the constraints.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ErrorMessage { get; set; }
Public Property ErrorMessage As String
	Get
	Set
public:
property String^ ErrorMessage {
	String^ get ();
	void set (String^ value);
}
member ErrorMessage : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: errorMessage is an empty string.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace